type DayKey = "monday" | "tuesday" | "wednesday" | "thursday" | "friday" | "saturday" | "sunday";

interface Meal {
  first: string[];
  main: string[];
}

interface DailyMenu {
  lunch: Meal;
  dinner: Meal;
}

interface MenuWeeks {
  week1: Record<DayKey, DailyMenu>;
  week2: Record<DayKey, DailyMenu>;
  week3: Record<DayKey, DailyMenu>;
  week4: Record<DayKey, DailyMenu>;
}

export const menu: MenuWeeks = {
  week1: {
    monday: {
      lunch: { first: ["Πουρές μπέικον", "Σούπα λαχανικών"], main: ["Μακαρόνια με κιμά και τυρί", "Κοτόπουλο λεμονάτο με ρύζι"] },
      dinner: { first: ["Πατάτες γκραντινέ"], main: ["Λουκάνικο χωριάτικο με πιλάφι"] },
    },
    tuesday: {
      lunch: { first: ["Κοφτό μακαρόνι με τυρί", "Ψαρόσουπα"], main: ["Ψάρι φιλέτο με ρύζι", "Ριζότο θαλασσινών"] },
      dinner: { first: ["Λαχανόρυζο", "Σούπα του Σεφ"], main: ["Σουτζουκάκια με ρύζι", "Γιουβαρλάκια"] },
    },
    wednesday: {
      lunch: { first: ["Μινεστρόνε", "Κριθαράκι κοκκινιστό"], main: ["Σπανακόρυζο", "Φακές"] },
      dinner: { first: ["Σούπα λαχανικών", "Τυρόπιτα"], main: ["Μακαρόνια με κόκκινη σάλτσα μανιταριών", "Αρακάς με καρότο καιπατάτα"] },
    },
    thursday: {
      lunch: { first: ["Πέννες Ναπολιτέν", "Σούπα του Σεφ"], main: ["Κοτόπουλο Μεξικιέν με ρύζι", "Μπιφτέκι ψητό με κριθαράκι λαχανικών"] },
      dinner: { first: ["Λαχανικά βραστά", "Κοτόσουπα"], main: ["Παστίτσιο ογκραντέν με τυριά", "Κοτόπουλο Μπιφτέκι με πατάτες φούρνου"] },
    },
    friday: {
      lunch: { first: ["Ντοματόσουπα", "Τουρσί με ελιές και ταραμοσαλάτα"], main: ["Φασόλια σούπα", "Φασολάκια με πατάτες"] },
      dinner: { first: ["Ριζότο θαλασσινών", "Ψαρόσουπα"], main: ["Ψάρι φέτα με ταμπουλέ", "Σουπιές με σπανάκι"] },
    },
    saturday: {
      lunch: { first: ["Κολοκυθοπατάτες", "Κρεατόσουπα"], main: ["Χοιρινό πρασοσέλινο", "Μοσχάρι με σάλτσα και ρύζι "] },
      dinner: { first: ["Σπανακόπιτα", "Σπανακόπιτα"], main: ["Κοτομπουκιές με ριζότο", "Μακαρόνια με κόκκινη σάλτσα και βασιλικό"] },
    },
    sunday: {
      lunch: { first: ["Ριζότο λαχανικών", "Χορτόσουπα"], main: ["Κεφτεδάκια φούρνου με πουρέ", "Ογκρατέν ζυμαρικών"] },
      dinner: { first: ["Τουρλού", "Τραχανάς"], main: ["Χοιρινή Μπριζόλα φούρνου με κουσκουσάκι", "Σουτζουκάκια κοκκινιστά με μανέστρα"] },
    },
  },

  week2: {
    monday: {
      lunch: { first: ["Σπανακόρυζο", "Κοτόσουπα"], main: ["Κοτόπουλο ψητό με πουρέ", "Κοτομπουκιές με σάλτσα και ρύζι"] },
      dinner: { first: ["Ομελέτα με πατάτες", "Σούπα λαχανικών"], main: ["Μπιφτέκι ψητό με πατάτες φούρνου", "Καρμπονάρα"] },
    },
    tuesday: {
      lunch: { first: ["Σκορδαλιά", "Ψαρόσουπα"], main: ["Ψάρι φέτα με πατάτες φούρνου", "Θαλασσινά με κοφτό μακαρονάκι"] },
      dinner: { first: ["Πουρέ με μπέικον", "Μινεστρόνε"], main: ["Σουτζουκάκια ψητά με κουσκουσάκι", "Σπετσοφάι με λουκάνικα"] },
    },
    wednesday: {
      lunch: { first: ["Μακαρόνια με σάλτσα και τυρί τριμμένο", "Σούπα Λαχανικών"], main: ["Φασόλια σούπα", "Φακόρυζο"] },
      dinner: { first: ["Σπανακόπιτα", "Ντοματόσουπα"], main: ["Ζυμαρικά με σάλτσα μανιτάρια και κρέμα γάλακτος", "Σπανακόρυζο"] },
    },
    thursday: {
      lunch: { first: ["Αρακάς βουτύρου", "Κρεατόσουπα"], main: ["Χοιρινό ριγανάτο με ρύζι", "Μακαρόνια με κιμά"] },
      dinner: { first: ["Λαχανορυζο", "Τραχανάς"], main: ["Κοτόπουλο μπιφτέκι με πουρέ", "Ογκραντέν με τυριά"] },
    },
    friday: {
      lunch: { first: ["Τουρσί με ελιές και ταραμοσαλάτα", "Σούπα Μινεστρόνε"], main: ["Φακές", "Φασόλια φούρνου γίγαντες"] },
      dinner: { first: ["Πίτσα τυριών", "Χορτόσουπα"], main: ["Ζυμαρικά με σάλτσα τυριών", "Γεμιστά λαδερά"] },
    },
    saturday: {
      lunch: { first: ["Ριζότο μανιταριών", "Κοτόσουπα"], main: ["Κοτόπουλο λεμονάτο με πατάτες φούρνου", "Κοτόπουλο Σνίτσελ με ριζότο"] },
      dinner: { first: ["Λουκάνικο με πουρέ", "Μανιταρόσουπα"], main: ["Καλαμαράκια κοκκινιστά με ρύζι", "Μπριάμ Λαχανικών"] },
    },
    sunday: {
      lunch: { first: ["Πένες με κόκκινη σάλτσα", "Κρεατόσουπα"], main: ["Χοιρινό ριγανάτο με ρύζι", "Λουκάνικα χωριάτικα με κουσκουσάκι"] },
      dinner: { first: ["Τυρόπιτα", "Σούπα του Σεφ"], main: ["Πίτσα σπέσιαλ", "Παστίτσιο"] },
    },
  },

  week3: {
    monday: {
      lunch: { first: ["Κριθαράκι κοκκινιστό", "Σούπα λαχανικών"], main: ["Μπιφτέκι ψητό με πουρέ", "Κοτόπουλο λεμονάτο με ρύζι"] },
      dinner: { first: ["Πατάτες γκραντινέ", "Σούπα μινεστρόνε"], main: ["Σπανακόρυζο", "Μακαρόνια με σάλτσα Ναπολιτέν"] },
    },
    tuesday: {
      lunch: { first: ["Λαχανόρυζο", "Ψαρόσουπα"], main: ["Ψάρι φέτα με ρύζι", "Παέγια θαλασσινών"] },
      dinner: { first: ["Τυρόπιτα", "Σούπα του Σεφ"], main: ["Λουκάνικο Φρανκφούρτης με πατάτες", "Κεφτεδάκια φούρνου με σπαγγέτι"] },
    },
    wednesday: {
      lunch: { first: ["Ριζότο με ζαμπόν και μπέικον", "Μινεστρόνε"], main: ["Αρακάς με πατάτες", "Φασολάδα"] },
      dinner: { first: ["Πουρέ μπέικον", "Σούπα εποχής"], main: ["Γιουβαρλάκια", "Σουφλέ με μπέικον, πατάτα και τυριά"] },
    },
    thursday: {
      lunch: { first: ["Μπριάμ", "Σούπα του Σεφ "], 
        main: ["Μακαρόνια με κιμά και τυρί τριμμένο", "Χοιρινό λεμονάτο με κουσκουσάκι"] },
      dinner: { first: ["Λαχανικά βραστά", "Κοτόσουπα"], 
        main: ["Παστίτσιο ογκραντέν με λαχανικά", "Πίτσα Μαργαρίτα"] },
    },
    friday: {
      lunch: { first: ["Τουρσί με ελιές και ταραμοσαλάτα", "Ντοματόσουπα"], 
        main: ["Φακές", "Σπανακόρυζο"] },
      dinner: { first: ["Κοφτό μακαρόνι με τυρί", "Σούπα λαχανικών"], 
        main: ["Θαλασσινά με κοφτό μακαρονάκι", "Ομελέτα με γαλοπούλα και τυρί"] },
    },
    saturday: {
      lunch: { first: ["Κολοκυθοπατάτες", "Κρεατόσουπα"], 
        main: ["Σπετσοφάι", "Μοσχάρι γιουβέτσι"] },
      dinner: { first: ["Σπανακόπιτα", "Μανιταρόσουπα"], 
        main: ["Κοτόπουλο φτερούγες BBQ με πουρέ", "Κοτόπουλο κοκκινιστό με κριθαράκι"] },
    },
    sunday: {
      lunch: { first: ["Ριζότο λαχανικών", "Χορτόσουπα"], 
        main: ["Κεφτεδάκια φούρνου με πουρέ", "Κεφτεδάκια φούρνου με πουρ"] },
      dinner: { first: ["Τουρλού", "Τραχανάς"], 
        main: ["Πέννες με μπέικον, κρέμα γάλακτος και μανιτάρια", "Αρνάκι ψητό με πατάτες φούρνου"] },
    },
  },

  week4: {
    monday: {
      lunch: { first: ["Πουρέ με μπέικον", "Ντοματόσουπα"], 
        main: ["Κοτόπουλο λεμονάτο με ριζότο", "Ζυμαρικά με σάλτσα κρέμα γάλακτος και μανιτάρια"] },
      dinner: { first: ["Αρακάς βουτύρου", "Χορτόσουπα"], 
        main: ["Κεφτεδάκια κοκκινιστά με ρύζι", "Γιουβαρλάκια"] },
    },
    tuesday: {
      lunch: { first: ["Σκορδαλιά", "Ψαρόσουπα"], 
        main: ["Ψάρι με πατάτες φούρνου", "Θαλασσινά με κοφτό μακαρονάκι"] },
      dinner: { first: ["Σπανακόρυζο", "Κοτόσουπα"], 
        main: ["Κοτόπουλο Σνίτσελ με ρύζι", "Πέννες Αμαρτιτσιάνα"] },
    },
    wednesday: {
      lunch: { first: ["Μακαρόνια με σάλτσα και τυρί τριμμένο", "Τουρσί με ελιές και ταραμοσαλάτα"], 
        main: ["Φακές", "Φάβα Κίτρινη"] },
      dinner: { first: ["Σπανακόπιτα", "Μινεστρόνε"], 
        main: ["Μπριάμ", "Σπανακόρυζο"] },
    },
    thursday: {
      lunch: { first: ["Λουκάνικο με πουρέ", "Μανιταρόσουπα"], 
        main: ["Χοιρινό ψητό με σως και κουσκουσάκι", "Σουτζουκάκια με ρύζι"] },
      dinner: { first: ["Λαχανορυζο", "Τραχανάς"], 
        main: ["Ζυμαρικά με σάλτσα Καρμπονάρα", "Κοτόπουλο ψητό με κριθαρότο λαχανικών"] },
    },
    friday: {
      lunch: { first: ["Κριθαράκι κοκκινιστό", "Σούπα Λαχανικών"], 
        main: ["Λαχανόρυζο", "Πένες με σάλτσα ντομάτας και λαχανικά"] },
      dinner: { first: ["Ομελέτα με πατάτες", "Σούπα λαχανικών"], 
        main: ["Πρασόρυζο", "Αρακάς με πατάτες "] },
    },
    saturday: {
      lunch: { first: ["Ριζότο λαχανικών", "Κοτόσουπα"], 
        main: ["Κοτόπουλο κοκκινιστό με κριθαράκι", "Κοτομπουκιές με σάλτσα και ρύζι"] },
      dinner: { first: ["Πίτσα τυριών", "Σούπα Μινεστρόνε"], 
        main: ["Σουφλέ πατάτας", "Μπιφτέκι με πουρέ"] },
    },
    sunday: {
      lunch: { first: ["Τουρλού", "Κρεατόσουπα"], 
        main: ["Μοσχάρι κοκκινιστό με γιουβέτσι", "Μακαρόνια με κιμά"] },
      dinner: { first: ["Τυρόπιτα", "Σούπα εποχής"], 
        main: ["Σουπιές σπανάκι", "Ογκρατέν ζυμαρικών"] },
    },
  },
};
