type DayKey = "monday" | "tuesday" | "wednesday" | "thursday" | "friday" | "saturday" | "sunday";

interface Meal {
  first: string[];
  main: string[];
}

interface DailyMenu {
  lunch: Meal;
  dinner: Meal;
}

interface MenuWeeks {
  week1: Record<DayKey, DailyMenu>;
  week2: Record<DayKey, DailyMenu>;
  week3: Record<DayKey, DailyMenu>;
  week4: Record<DayKey, DailyMenu>;
}

export const menu: MenuWeeks = {
  week1: {
    monday: {
      lunch: { first: ["Πουρές μπέικον", "Σούπα λαχανικών"], main: ["Μακαρόνια με κιμά και τυρί", "Κοτόπουλο λεμονάτο με ρύζι"] },
      dinner: { first: ["Πατάτες γκραντινέ"], main: ["Λουκάνικο χωριάτικο με πιλάφι"] },
    },
    tuesday: {
      lunch: { first: ["Κοφτό μακαρόνι με τυρί", "Ψαρόσουπα"], main: ["Ψάρι φιλέτο με ρύζι", "Ριζότο θαλασσινών"] },
      dinner: { first: ["Λαχανόρυζο", "Σούπα του Σεφ"], main: ["Σουτζουκάκια με ρύζι", "Γιουβαρλάκια"] },
    },
    wednesday: {
      lunch: { first: ["Μινεστρόνε", "Κριθαράκι κοκκινιστό"], main: ["Σπανακόρυζο", "Φακές"] },
      dinner: { first: ["Σούπα λαχανικών", "Τυρόπιτα"], main: ["Μακαρόνια με κόκκινη σάλτσα μανιταριών", "Αρακάς με καρότο καιπατάτα"] },
    },
    thursday: {
      lunch: { first: ["Πέννες Ναπολιτέν", "Σούπα του Σεφ"], main: ["Κοτόπουλο Μεξικιέν με ρύζι", "Μπιφτέκι ψητό με κριθαράκι λαχανικών"] },
      dinner: { first: ["Λαχανικά βραστά", "Κοτόσουπα"], main: ["Παστίτσιο ογκραντέν με τυριά", "Κοτόπουλο Μπιφτέκι με πατάτες φούρνου"] },
    },
    friday: {
      lunch: { first: ["Ντοματόσουπα", "Τουρσί με ελιές και ταραμοσαλάτα"], main: ["Φασόλια σούπα", "Φασολάκια με πατάτες"] },
      dinner: { first: ["Ριζότο θαλασσινών", "Ψαρόσουπα"], main: ["Ψάρι φέτα με ταμπουλέ", "Σουπιές με σπανάκι"] },
    },
    saturday: {
      lunch: { first: ["Κολοκυθοπατάτες", "Κρεατόσουπα"], main: ["Χοιρινό πρασοσέλινο", "Μοσχάρι με σάλτσα και ρύζι "] },
      dinner: { first: ["Σπανακόπιτα", "Σπανακόπιτα"], main: ["Κοτομπουκιές με ριζότο", "Μακαρόνια με κόκκινη σάλτσα και βασιλικό"] },
    },
    sunday: {
      lunch: { first: ["Ριζότο λαχανικών", "Χορτόσουπα"], main: ["Κεφτεδάκια φούρνου με πουρέ", "Ογκρατέν ζυμαρικών"] },
      dinner: { first: ["Τουρλού", "Τραχανάς"], main: ["Χοιρινή Μπριζόλα φούρνου με κουσκουσάκι", "Σουτζουκάκια κοκκινιστά με μανέστρα"] },
    },
  },

  week2: {
    monday: {
      lunch: { first: ["Σπανακόρυζο", "Σκορδαλιά"], main: ["Κοτόπουλο ψητό με πουρέ", "Ψάρι φέτα με πατάτες φούρνου"] },
      dinner: { first: ["Ομελέτα με πατάτες", "Πουρές με μπέικον"], main: ["Μπιφτέκι ψητό με πατάτες φούρνου", "Σουτζουκάκια ψητά με κουσκουσάκι"] },
    },
    tuesday: {
      lunch: { first: ["Μακαρόνια με σάλτσα και τυρί τριμμένο", "Αρακάς βουτύρου"], main: ["Φασόλια σούπα", "Μακαρόνια με κιμά"] },
      dinner: { first: ["Σπανακόπιτα", "Λαχανορύζο"], main: ["Ζυμαρικά με σάλτσα μανιτάρια και κρέμα γάλακτος", "Κοτόπουλο μπιφτέκι με πουρέ"] },
    },
    wednesday: {
      lunch: { first: ["Μακαρόνια με σάλτσα και τυρί τριμμένο", "Σούπα Λαχανικών"], main: ["Φασόλια σούπα", "Φακόρυζο"] },
      dinner: { first: ["Σπανακόπιτα", "Ντοματόσουπα"], main: ["Ζυμαρικά με σάλτσα μανιτάρια και κρέμα γάλακτος", "Σπανακόρυζο"] },
    },
    thursday: {
      lunch: { first: ["Πένες με κόκκινη σάλτσα", "Κοτόσουπα"], main: ["Χοιρινό ριγανάτο με ρύζι", "Θαλασσινά με κοφτό μακαρονάκι"] },
      dinner: { first: ["Σούπα λαχανικών", "Μινεστρόνε"], main: ["Πίτσα σπέσιαλ", "Σπετσοφάι με λουκάνικα"] },
    },
    friday: {
      lunch: { first: ["Ψαρόσουπα", "Σούπα Λαχανικών"], main: ["Φακόρυζο", "Χοιρινό ριγανάτο με ρύζι"] },
      dinner: { first: ["Τραχανάς", "Χορτόσουπα"], main: ["Σπανακόρυζο", "Ογκραντέν με τυριά"] },
    },
    saturday: {
      lunch: { first: ["Κοτόσουπα", "Κρεατόσουπα"], main: ["Φασολιά φούρνου", "Γίγαντες"] },
      dinner: { first: ["Σούπα του Σεφ", "Ντοματόσουπα"], main: ["Γεμιστά λαδερά", "Μπριάμ Λαχανικών"] },
    },
    sunday: {
      lunch: { first: ["Σούπα Μινεστρόνε", "Κοτόσουπα"], main: ["Κοτόπουλο Σνίτσελ με ριζότο", "Λουκάνικα χωριάτικα με κουσκουσάκι"] },
      dinner: { first: ["Κρεατόσουπα", "Σούπα του Σεφ"], main: ["Παστίτσιο", "Ογκραντέν με τυριά"] },
    },
  },

  week3: {
    monday: {
      lunch: { first: ["Κριθαράκι κοκκινιστό", "Λαχανόρυζο"], main: ["Μπιφτέκι ψητό με πουρέ", "Ψάρι φέτα με ρύζι"] },
      dinner: { first: ["Πατάτες γκραντινέ", "Τυρόπιτα"], main: ["Σπανακόρυζο", "Λουκάνικο Φρανκφούρτης με πατάτες"] },
    },
    tuesday: {
      lunch: { first: ["Ριζότο με ζαμπόν και μπέικον", "Μπριάμ"], main: ["Αρακάς με πατάτες", "Μακαρόνια με κιμά και τυρί"] },
      dinner: { first: ["Πουρές μπέικον", "Σπανακόπιτα"], main: ["Γιουβαρλάκια", "Παστίτσιο ογκραντέν με λαχανικά"] },
    },
    wednesday: {
      lunch: { first: ["Ριζότο με ζαμπόν και μπέικον", "Μινεστρόνε"], main: ["Αρακάς με πατάτες", "Φασολάδα"] },
      dinner: { first: ["Πουρέ μπέικον", "Σούπα εποχής"], main: ["Γιουβαρλάκια", "Σουφλέ με μπέικον, πατάτα και τυριά"] },
    },
    thursday: {
      lunch: { first: ["Ριζότο λαχανικών", "Πένες με κόκκινη σάλτσα"], 
        main: ["Κεφτεδάκια φούρνου με πουρέ", "Μακαρόνια με σάλτσα Ναπολιτέν"] },
      dinner: { first: ["Σούπα εποχής", "Κοτόσουπα"], 
        main: ["Κεφτεδάκια φούρνου με σπαγγέτι", "Σουφλέ με μπέικον, πατάτα και τυριά"] },
    },
    friday: {
      lunch: { first: ["Σούπα λαχανικών", "Ψαρόσουπα"], 
        main: ["Κοτόπουλο λεμονάτο με ρύζι", "Παέγια θαλασσινών"] },
      dinner: { first: ["Πίτσα Μαργαρίτα", "Ομελέτα με γαλοπούλα και τυρί"], 
        main: ["Κοτόπουλο κοκκινιστό με κριθαράκι", "Αρνάκι ψητό με πατάτες φούρνου"] },
    },
    saturday: {
      lunch: { first: ["Μινεστρόνε", "Κρεατόσουπα"], 
        main: ["Φασολιά φούρνου", "Γίγαντες"] },
      dinner: { first: ["Σούπα του Σεφ", "Τραχανάς"], 
        main: ["Σπανακόρυζο", "Ζυμαρικά με σάλτσα Καρμπονάρα"] },
    },
    sunday: {
      lunch: { first: ["Ντοματόσουπα", "Κοτόσουπα"], 
        main: ["Κοτόπουλο Σνίτσελ με ριζότο", "Λουκάνικα χωριάτικα με κουσκουσάκι"] },
      dinner: { first: ["Χορτόσουπα", "Σούπα Μινεστρόνε"], 
        main: ["Γιουβαρλάκια", "Μπριάμ"] },
    },
  },

  week4: {
    monday: {
      lunch: { first: ["Πουρέ με μπέικον", "Σκορδαλιά"], main: ["Κοτόπουλο λεμονάτο με ριζότο", "Ψάρι με πατάτες φούρνου"] },
      dinner: { first: ["Αρακάς βουτύρου", "Σπανακόρυζο"], main: ["Κεφτεδάκια κοκκινιστά με ρύζι", "Κοτόπουλο Σνίτσελ με ρύζι"] },
    },
    tuesday: {
      lunch: { first: ["Μακαρόνια με σάλτσα και τυρί", "Λουκάνικο με πουρέ"], 
        main: ["Φακές", "Χοιρινό ψητό με σως και κουσκουσάκι"] },
      dinner: { first: ["Σπανακόπιτα", "Λαχανορύζο"], 
        main: ["Σπανακόρυζο", "Ζυμαρικά με σάλτσα κρέμα γάλακτος και μανιτάρια"] },
    },
    wednesday: {
      lunch: { first: ["Κριθαράκι κοκκινιστό", "Ριζότο λαχανικών"], 
        main: ["Κοτόπουλο κοκκινιστό με κριθαράκι", "Μοσχάρι κοκκινιστό με γιουβέτσι"] },
      dinner: { first: ["Ομελέτα με πατάτες", "Πίτσα τυριών"], 
        main: ["Σουφλέ πατάτας", "Σουπιές σπανάκι"] },
    },
    thursday: {
      lunch: { first: ["Τουρλού", "Ντοματόσουπα"], 
        main: ["Κοτόπουλο ψητό με κριθαρότο λαχανικών", "Αρακάς με πατάτες"] },
      dinner: { first: ["Χορτόσουπα", "Κοτόσουπα"], 
        main: ["Μπιφτέκι με πουρέ", "Ογκραντέν ζυμαρικών"] },
    },
    friday: {
      lunch: { first: ["Σούπα Λαχανικών", "Κοτόσουπα"], 
        main: ["Ζυμαρικά με σάλτσα Αμαρτιτσιάνα", "Γιουβαρλάκια"] },
      dinner: { first: ["Σπανακόρυζο", "Μπριάμ"], 
        main: ["Κοτόπουλο ψητό με κριθαρότο λαχανικών", "Ογκραντέν ζυμαρικών"] },
    },
    saturday: {
      lunch: { first: ["Μινεστρόνε", "Κρεατόσουπα"], 
        main: ["Φασολιά φούρνου", "Γίγαντες"] },
      dinner: { first: ["Τραχανάς", "Σούπα εποχής"], 
        main: ["Σπανακόρυζο", "Ζυμαρικά με σάλτσα Ναπολιτέν"] },
    },
    sunday: {
      lunch: { first: ["Κοτόσουπα", "Σούπα Λαχανικών"], 
        main: ["Κοτόπουλο Σνίτσελ με ριζότο", "Λουκάνικα χωριάτικα με κουσκουσάκι"] },
      dinner: { first: ["Χορτόσουπα", "Σούπα Μινεστρόνε"], 
        main: ["Μπριάμ", "Ογκραντέν με τυριά"] },
    },
  },
};
